tests/stubs/invoices.json

{
    "total": 1,
    "offset": 0,
    "limit": 10,
    "invoices": [{
        "serial_number": "INV-01-987654",
        "profile_id": "edb6322b-8e11-48e9-8d6f-6402e445e50d",
        "profile_name": "My Company Ltd",
        "billing_information": {
            "legal_name": "My Company Ltd",
            "vat_number": "GB123456789",
            "address_line_1": "199 Bishopsgate",
            "address_line_2": "Spitalfields",
            "city": "London",
            "postal_code": "EC2M 3TY",
            "country_name": "United Kingdom"
        },
        "mode": "reseller",
        "status": "paid",
        "issuing_date": "2020-03-31",
        "billing_period": "monthly",
        "from_date":  "2020-03-01",
        "to_date": "2020-03-31",
        "due_date": "2020-04-15",
        "currency": "EUR",
        "total": "13579.24",
        "lines": {
            "total": 15,
            "data": [],
            "next": "/invoices/lines?serial_number=INV-01-987654&offset=10"
        },
        "taxes_summary": [
            {
                "tax_regime": "STAR",
                "subtotal": "6543.21",
                "tax_percentage": "0.00",
                "tax_amount": "0.00",
                "total": "6543.21"
            },
            {
                "tax_regime": "G-VAT-R",
                "subtotal": "5912.63",
                "tax_percentage": "19.00",
                "tax_amount": "1123.40",
                "total": "7036.03"
            }
        ],
        "reference": "My Company Ltd - SEPA - Monthly 2020-03",
        "travelperk_bank_account": {
            "bank_name": "La Caixa",
            "account_number": "ES01 2345 6789 1098 7654 3210",
            "bic": "CAIX ES BB XXX",
            "reference": "INV-01-987654"
        },
        "pdf": "https://api.travelperk.com/invoices/INV-01-987654/pdf"
    }]
}
